/* Компонент с полем поиска и ссылками над этим полем поиска.
 * Хранит набор ссылок в себе. Для поля поиска никакие пропсы не получает.
 * Props: нет.
 * Рендер: поле поиска с кнопкой и текстовой подсказкой и ссылки над ним.
 * Примечание: как вариант, можно разделить поле поиска и ссылки над ним на два разных компонента, но это будет
 *  зависеть от требований бизнеса.
 */

import React from "react";
import PropTypes from "prop-types";

Search.propTypes = {};

function Search(props) {
  return <div></div>;
}

export default Search;
